Tekla Open API Reference for Tekla Structures 2025
Arc.Normal Property
 Gets normal of the arc, which defines the axis of rotation of the radial vector pointing to the start point of the arc.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Normal { get; }
Public ReadOnly Property Normal As Vector
	Get
Property Value
Type: Vector
See Also
Reference
Arc Class
Tekla.Structures.Geometry3d Namespace